conv.0.weight 128
conv.0.bias 128
conv.2.weight 256
conv.2.bias 256
conv.4.weight 512
conv.4.bias 512
fc_layer_initial.0.weight 2048
fc_layer_initial.0.bias 2048
fc_layer_initial.2.weight 1024
fc_layer_initial.2.bias 1024
advantage_layer.0.weight 1024
advantage_layer.0.bias 1024
advantage_layer.2.weight 14
advantage_layer.2.bias 14
value_layer.0.weight 1024
value_layer.0.bias 1024
value_layer.2.weight 1
value_layer.2.bias 1
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 128, 18, 18]          24,704
         LeakyReLU-2          [-1, 128, 18, 18]               0
            Conv2d-3            [-1, 256, 8, 8]         524,544
         LeakyReLU-4            [-1, 256, 8, 8]               0
            Conv2d-5            [-1, 512, 6, 6]       1,180,160
         LeakyReLU-6            [-1, 512, 6, 6]               0
            Linear-7                 [-1, 2048]      37,750,784
              ReLU-8                 [-1, 2048]               0
            Linear-9                 [-1, 1024]       2,098,176
             ReLU-10                 [-1, 1024]               0
           Linear-11                 [-1, 1024]       1,049,600
             ReLU-12                 [-1, 1024]               0
           Linear-13                    [-1, 1]           1,025
           Linear-14                 [-1, 1024]       1,049,600
             ReLU-15                 [-1, 1024]               0
           Linear-16                   [-1, 14]          14,350
================================================================
Total params: 43,692,943
Trainable params: 43,692,943
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.07
Forward/backward pass size (MB): 1.24
Params size (MB): 166.68
Estimated Total Size (MB): 167.99
----------------------------------------------------------------

